def showmaze(maze, N, depth):
    print('-------------------------------',end='\n')
    print('Step No:' + str(depth),end='\n')
    for i in range(N):
        print(maze[i], end='\n')

    print('-------------------------------',end='\n')




def DS(x, y, depth):
    # ゴールについたとき
    if maze[x][y] == 1:
        print(depth)
        exit()

    showmaze(maze, N, depth)

    # ゴールじゃないとき、探索済みとする
    maze[x][y] = 2

    #現在位置の上下左右を探索する。いけるところまでぐんぐん突き進んでいく。
    if maze[x - 1][y] < 2:
        DS(x - 1, y, depth + 1)
    if maze[x + 1][y] < 2:
        DS(x + 1, y, depth + 1)
    if maze[x][y - 1] < 2:
        DS(x, y - 1, depth + 1)
    if maze[x][y + 1] < 2:
        DS(x, y + 1, depth + 1)

    maze[x][y] = 0

if __name__ == '__main__':

    maze = [
        [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9],
        [9, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 9],
        [9, 0, 9, 0, 0, 0, 9, 9, 0, 9, 9, 9],
        [9, 0, 9, 9, 0, 9, 0, 0, 0, 9, 0, 9],
        [9, 0, 0, 0, 9, 0, 0, 9, 9, 0, 9, 9],
        [9, 9, 9, 0, 0, 9, 0, 9, 0, 0, 0, 9],
        [9, 0, 0, 0, 9, 0, 9, 0, 0, 9, 1, 9],
        [9, 0, 9, 0, 0, 0, 0, 9, 0, 0, 9, 9],
        [9, 0, 0, 9, 0, 9, 0, 0, 9, 0, 0, 9],
        [9, 0, 9, 0, 9, 0, 9, 0, 0, 9, 0, 9],
        [9, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 9],
        [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]
    ]
    N = 12
    DS(1, 1, 0)